using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
//Boris Z
#region *** Task 1 ***
//а) Дописать структуру Complex, добавив метод вычитания комплексных чисел.
//Продемонстрировать работу структуры;
//б) Дописать класс Complex, добавив методы вычитания и произведения чисел.Проверить
//работу класса;
#endregion *** Task 1 ***
#region *** Task 2 ***
//а) С клавиатуры вводятся числа, пока не будет введен 0 (каждое число в новой строке).
//Требуется подсчитать сумму всех нечетных положительных чисел.Сами числа и сумму вывести
//на экран; Используя tryParse;
//б) Добавить обработку исключительных ситуаций на то, что могут быть введены не корректные
//данные.При возникновении ошибки вывести сообщение.
#endregion *** Task 2 ***
#region *** Task 3 ***
// Описать класс дробей - рациональных чисел, являющихся отношением двух целых чисел.
// Предусмотреть методы сложения, вычитания, умножения и деления дробей. Написать
// программу, демонстрирующую все разработанные элементы класса.Достаточно решить 2
// задачи.Все программы сделайть в одном решении.
#endregion *** Task 3 ***

namespace Lesson3
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
             * Тернарная операция
             * Перечисления
             * Оператор выбора
             * continue
             * рекурсия =>
            */
            #region *** Task 1 ***
            #endregion *** Task 1 ***
            #region *** Task 2 ***
            #endregion *** Task 2 ***
            #region *** Task 3 ***
            #endregion *** Task 3 ***
        }
    }
}
